# Module 5, Lecture 5.1 INSERT

  

## Part A: Insert records into tables in PostgreSQL using the INSERT INTO statement

### Step 1: Enter the following Faculty into the Faculty table of the University database. 

The INSERT INTO syntax is

> ```
> INSERT INTO [table_name] (
>     [columns]
> )
> VALUES ([expression]);
> ```

Remember that the multiple expression use of INSERT INTO separates each expression by a comma and encloses each expression in parentheses.

Faculty ID |  Faculty Number | Last Name | First Name | City | State | Zip Code | Birth Date | Start Date | Status | Teaching Hours | Phone | Room | Email
 :--- | --- | ---: | :--- | --- | --- | --- | --- | --- | --- | :---: | --- | --- | ---
 4 | STJO7190 | Johnson | Steven | San Jose | CA | 94088 | 10/10/80 | 3/17/19 | Yes | 9 | 408-719-4329 | 631 | sjohns@college.edu
 5 | | Sanders | Keisha | Jacksonville | FL | 32034 | 7/10/78 | 3/17/19 | Yes | 9 | 904-327-0184 | 637 | ksande@college.edu
 6 | JUBA1634 | Baker | Julie | Waco | TX | 76712 | 5/15/80 | 1/6/20 | Yes | 6 | 254-498-1023 | 638 | jbaker@college.edu

Notice that in the above INSERT statement we did not add the school or program information. We will go back and add this later. You should have successfully updated your faculty table. If you used the RETURNING clause, you should have received a confirmation that all of your rows were inserted, either in the form or a value, or the rwos themselves.

  

Did you notice that there was no faculty number for Ms. Sanders? How did you deal with that? While there is no DEFAULT value for the faculty number column, you could use the term DEFAULT or simply place a blank space (' ') in the column. We will go back in and add this later. It was merely a data entry error!

### Step 2: Enter the following program and school data into the appropriate tables, then select all records from the program table

### Schools

| School ID | School Name |
| --- | --- |
| 4 | School of Business |
| 5 | Design and Visual Art |

### Programs

| Program ID | Program Name | School ID | Director ID |
| --- | --- | --- | --- |
| 6 | Criminology | 1 | NULL |
| 7 | Interior Design | 5 | NULL |
| 8 | Info Sys. Mgmnt | 4 | NULL |
| 9 | Game Design | 1 | NULL |
| 10 | Cybersecurity | 2 | 1 |

Notice the prog\_director fileds that are blank? We can fill these using a new INSERT even though we have a primary key on the table. We do this with the ON CONFLICT expression by adding a DO clause to the expression and givin git an UPDATE statement. We have not covered updates yet, that is in the next section. However, I wanted you to see the functionality of the ON CONFLICT clause in the INSERT statement.

Copy your above code in Cell 6 (or whatever cell you entered the progams in if you did not spearate your cells). Add the following values to the prog\_director\_id column then return all written values with the RETURNING clause. You will need to use the ON CONFLICT DO UPDATE clauses. An example of this is below.

> ```
> INSERT INTO [ table_name ] ( [ columns ] )
> VALUES ([ expression ])
> ON CONFLICT (constraint_field) DO UPDATE SET [ expression ];
> ```

| ID | Program Director |
| --- | --- |
| 6 | 4 |
| 7 | 4 |
| 8 | 5 |
| 9 | 6 |

You should see either the output of the the rows (if you used RETURNING \*) or the expression you passed the RETURNING clause. I used "Written" so that each of my rows would show "Written" as the response. If you did not get your rows to update, review your ON CONFLICT statement. You have to supply a column to reference that has the constraint or a constraint name (i.e. prog\_pkey) if you explicitly defined a constraint in your table. the easiest method is to use the key column name. In this case, it is the prog\_id column. Then you must put an UPDATE statment after the DO declaration. The correct query is below.

> ```
> INSERT INTO program 
> VALUES (6, 'Criminology', 1, 4),
> (7, 'Interior Design', 1, 4),
> (8, 'Info Sys. Mgmnt', 4, 5),
> (9, 'Game Design', 4, 6),
> (10, 'Cybersecurity', 2, 1)
> ON CONFLICT (prog_id) DO UPDATE SET prog_director_id = EXCLUDED.prog_director_id
> RETURNING 'Written';
> ```

### Step 3: Enter the below students in the appropriate table. Be sure to use a RETURNING clause to verify your rows were written to the table.

| ID | Number | Last | First | City | State | Zip | Birth Date | Start Sem. | Enrolled | Honors | GPA | Credit Hrs | Acad. Lvl | Prog ID | School ID | Degree ID |
| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |
| 4 | THMA7205 | Magnussen | Thor | Atlanta | GA | 30334 | 5/1/1981 | 192 | Yes | No | 2.97 | 12 | 1 | 8 | 4 | NULL
| 5 | ANTA7443 | Tanner | Angela | Washington | DC | 20001 | 9/13/1987 | 201 | Yes | Yes | 3.98 | 16 | 2 | 10 | 2 | NULL
| 6 | CYMU0018 | Musgrave | Cynthia | Detroit | MI |48127 | 2/13/1974 | 191 | No | No | 3.14 | 27 | 1 | 7 | 5 | NULL

### Step 4: Insert the following courses in the course table. Use the default values for the class size and meeting days unless noted otherwise. Make any updates necessary to fix value errors using the appropriate ALTER statement.

| Course ID | Name | Code | Number | Status | Size | Meet Days | Professor | Meet Room |
| --- | --- | --- | --- | --- | --- | --- | --- | --- |
| 5 | Intro to ERM | ACSC | 410 | Active | DEFAULT | DEFAULT | 2 | 210 |
| 6 | Data Structures | COSC | 350 | Inactive | DEFAULT | DEFAULT | 2 | Online |
| 7 | Database Design | ISYS | 307 | Active | 15 | M, W, F | 1 | 371 |
| 8 | History of Int Des | ADAH | 202 | Active | 10 | DEFAULT | 6 | 231 |
| 9 | Ethical Hacking | ISYS | 470 | Active | DEFAULT | DEFAULT | 1 | Online |
| 10 | Princ of Game Des | ADIN | 300 | Active | 7 | DEFAULT | 4 | Online |
| 11 | Police Academy | CRIM | 494 | Active | DEFAULT | DEFAULT | 5 | Anx |

## Part B: Insert records into tables using the INSERT SELECT statement

Step 1: Copy the below SQL code to a code cell and execute it. 

```sql
CREATE TABLE tmp_term_class (
    term_id INTEGER
    ,class_id INTEGER
    ,fac_id INTEGER
    ,class_start_date DATE
    ,class_end_date DATE
    ,stud_id INTEGER);

INSERT INTO tmp_term_class
VALUES (
    2
    ,5
    ,1
    ,'2019-01-07'
    ,'2019-03-01'
    ,4
)
,(
    2
    ,7
    ,1
    ,'2019-01-07'
    ,'2019-03-01'
    ,4
)
,(
    5
    ,5
    ,1
    ,'2019-08-26'
    ,'2019-10-18'
    ,5
)
,(
    5
    ,3
    ,1
    ,'2019-08-26'
    ,'2019-10-18'
    ,5
)
,(
    1
    ,8
    ,6
    ,'2018-10-21'
    ,'2018-12-14'
    ,6
);
```

Step 2: Write a INSERT SELECT statement to add the data from temp table to the term\_class relationship table

Step 3: Update the term\_people table using the output from the above INSERT SELECT operations. Build a new table called tmp\_term\_people and write the data to the table. Then copy that table into the term\_people table using the INSERT SELECT query.

  

Your term\_people table updates should be limited to the new students added above (4, 5, and 6). Make sure the include the correct term and faculty based on teh term\_class update.

Your query should have returned the following three rows


> | | term_id | stud_id | fac_id | term_start_date | term_end_date |
> |---|---|---|---|---|---|
> | 1 | 1 | 6 | 6 | 2018-10-21 | 2018-12-14 |
> | 2 | 2 | 4 | 1 | 2019-01-07 | 2019-03-01 |
> | 3 | 5 | 5 | 1 | 2019-08-26 | 2019-10-28 |